# create Pandas Series

In [2]:
import pandas as pd

In [3]:
a = pd.Series([1,2,3,4,5])

In [4]:
a

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
type(a)

pandas.core.series.Series

In [6]:
a[2]

3

In [7]:
a = pd.Series(['a','b','c'])

In [8]:
a

0    a
1    b
2    c
dtype: object

In [9]:
a = pd.date_range(start = '01-01-2018', end = '23-5-2018')

In [10]:
a

DatetimeIndex(['2018-01-01', '2018-01-02', '2018-01-03', '2018-01-04',
               '2018-01-05', '2018-01-06', '2018-01-07', '2018-01-08',
               '2018-01-09', '2018-01-10',
               ...
               '2018-05-14', '2018-05-15', '2018-05-16', '2018-05-17',
               '2018-05-18', '2018-05-19', '2018-05-20', '2018-05-21',
               '2018-05-22', '2018-05-23'],
              dtype='datetime64[ns]', length=143, freq='D')

In [11]:
type(a)

pandas.core.indexes.datetimes.DatetimeIndex

# Pandas dataframe

In [12]:
import numpy as np

In [13]:
temp = np.random.randint(low = 20, high =100, size = [20,])
name = np.random.choice(['Abhay','Teclov','Geekshub','Ankit'],20)
random = np.random.choice([10,11,13,12,14],20)

In [14]:
a = list(zip(temp, name, random))

In [15]:
df = pd.DataFrame(data = a, columns=['temp','name','random'])

In [16]:
df

    temp      name  random
0     80    Teclov      10
1     93     Ankit      10
2     72     Ankit      10
3     84     Ankit      13
4     43     Abhay      14
5     54    Teclov      11
6     55     Abhay      11
7     42  Geekshub      13
8     70  Geekshub      14
9     88     Ankit      10
10    35     Abhay      12
11    51     Ankit      14
12    79  Geekshub      11
13    88    Teclov      10
14    31     Ankit      12
15    26     Abhay      14
16    37     Ankit      11
17    95     Abhay      14
18    94    Teclov      14
19    52     Abhay      13

In [17]:
type(df)

pandas.core.frame.DataFrame

In [18]:
temp = np.random.randint(low = 20, high =100, size = [20,])
name = np.random.choice(['Abhay','Teclov','Geekshub','Ankit'],20)
random = np.random.choice([10,11,13,12,14],20)

In [19]:
df = pd.DataFrame({'temp':temp, 'name':name, 'random':random})

In [20]:
type(df)

pandas.core.frame.DataFrame

In [21]:
df.head()

   temp      name  random
0    53     Ankit      12
1    31     Abhay      14
2    81  Geekshub      10
3    28     Abhay      14
4    37     Abhay      10

In [22]:
df.tail()

    temp    name  random
15    47   Abhay      10
16    77   Abhay      14
17    87  Teclov      11
18    84  Teclov      11
19    82  Teclov      11

In [23]:
df.shape

(20, 3)

In [24]:
df.columns

Index(['temp', 'name', 'random'], dtype='object')

In [25]:
df.name

0        Ankit
1        Abhay
2     Geekshub
3        Abhay
4        Abhay
5     Geekshub
6        Abhay
7       Teclov
8        Abhay
9        Abhay
10       Abhay
11      Teclov
12       Ankit
13       Abhay
14      Teclov
15       Abhay
16       Abhay
17      Teclov
18      Teclov
19      Teclov
Name: name, dtype: object

In [26]:
df['name']

0        Ankit
1        Abhay
2     Geekshub
3        Abhay
4        Abhay
5     Geekshub
6        Abhay
7       Teclov
8        Abhay
9        Abhay
10       Abhay
11      Teclov
12       Ankit
13       Abhay
14      Teclov
15       Abhay
16       Abhay
17      Teclov
18      Teclov
19      Teclov
Name: name, dtype: object

In [27]:
df['temp'].describe()

count    20.000000
mean     60.150000
std      23.855431
min      20.000000
25%      36.750000
50%      61.500000
75%      81.250000
max      90.000000
Name: temp, dtype: float64

In [28]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 3 columns):
temp      20 non-null int32
name      20 non-null object
random    20 non-null int32
dtypes: int32(2), object(1)
memory usage: 400.0+ bytes

In [29]:
df.values

array([[53, 'Ankit', 12],
       [31, 'Abhay', 14],
       [81, 'Geekshub', 10],
       [28, 'Abhay', 14],
       [37, 'Abhay', 10],
       [81, 'Geekshub', 13],
       [50, 'Abhay', 10],
       [88, 'Teclov', 10],
       [48, 'Abhay', 12],
       [79, 'Abhay', 14],
       [34, 'Abhay', 12],
       [20, 'Teclov', 11],
       [36, 'Ankit', 13],
       [70, 'Abhay', 13],
       [90, 'Teclov', 13],
       [47, 'Abhay', 10],
       [77, 'Abhay', 14],
       [87, 'Teclov', 11],
       [84, 'Teclov', 11],
       [82, 'Teclov', 11]], dtype=object)

In [30]:
df

    temp      name  random
0     53     Ankit      12
1     31     Abhay      14
2     81  Geekshub      10
3     28     Abhay      14
4     37     Abhay      10
5     81  Geekshub      13
6     50     Abhay      10
7     88    Teclov      10
8     48     Abhay      12
9     79     Abhay      14
10    34     Abhay      12
11    20    Teclov      11
12    36     Ankit      13
13    70     Abhay      13
14    90    Teclov      13
15    47     Abhay      10
16    77     Abhay      14
17    87    Teclov      11
18    84    Teclov      11
19    82    Teclov      11

In [31]:
df.set_index('temp', inplace = True)

In [32]:
df

          name  random
temp
53       Ankit      12
31       Abhay      14
81    Geekshub      10
28       Abhay      14
37       Abhay      10
81    Geekshub      13
50       Abhay      10
88      Teclov      10
48       Abhay      12
79       Abhay      14
34       Abhay      12
20      Teclov      11
36       Ankit      13
70       Abhay      13
90      Teclov      13
47       Abhay      10
77       Abhay      14
87      Teclov      11
84      Teclov      11
82      Teclov      11

In [33]:
df.sort_index(axis =0, ascending=False)

          name  random
temp
90      Teclov      13
88      Teclov      10
87      Teclov      11
84      Teclov      11
82      Teclov      11
81    Geekshub      10
81    Geekshub      13
79       Abhay      14
77       Abhay      14
70       Abhay      13
53       Ankit      12
50       Abhay      10
48       Abhay      12
47       Abhay      10
37       Abhay      10
36       Ankit      13
34       Abhay      12
31       Abhay      14
28       Abhay      14
20      Teclov      11

In [34]:
df.sort_values(by ='random', ascending = False)

          name  random
temp
79       Abhay      14
77       Abhay      14
28       Abhay      14
31       Abhay      14
90      Teclov      13
81    Geekshub      13
70       Abhay      13
36       Ankit      13
53       Ankit      12
34       Abhay      12
48       Abhay      12
20      Teclov      11
87      Teclov      11
84      Teclov      11
82      Teclov      11
88      Teclov      10
50       Abhay      10
37       Abhay      10
47       Abhay      10
81    Geekshub      10

In [35]:
df.drop(['random'], axis =1)

          name
temp
53       Ankit
31       Abhay
81    Geekshub
28       Abhay
37       Abhay
81    Geekshub
50       Abhay
88      Teclov
48       Abhay
79       Abhay
34       Abhay
20      Teclov
36       Ankit
70       Abhay
90      Teclov
47       Abhay
77       Abhay
87      Teclov
84      Teclov
82      Teclov

In [36]:
df.head()

          name  random
temp
53       Ankit      12
31       Abhay      14
81    Geekshub      10
28       Abhay      14
37       Abhay      10

In [37]:
df.iloc[[0,1]]

       name  random
temp
53    Ankit      12
31    Abhay      14

In [38]:
df.iloc[1:3,1]

temp
31    14
81    10
Name: random, dtype: int32

In [39]:
df.iloc[[True,True,False,True]]

       name  random
temp
53    Ankit      12
31    Abhay      14
28    Abhay      14

In [40]:
df.head()

          name  random
temp
53       Ankit      12
31       Abhay      14
81    Geekshub      10
28       Abhay      14
37       Abhay      10

In [42]:
df.loc[37,:]

name      Abhay
random       10
Name: 37, dtype: object

In [44]:
df.loc[[37,84,34]]

        name  random
temp
37     Abhay      10
84    Teclov      11
34     Abhay      12

In [45]:
df.loc[[37,84],'name':'random']

        name  random
temp
37     Abhay      10
84    Teclov      11

In [46]:
df.loc[[True, True, False, True]]

       name  random
temp
53    Ankit      12
31    Abhay      14
28    Abhay      14

In [47]:
df.loc[df.random > 13]

       name  random
temp
31    Abhay      14
28    Abhay      14
79    Abhay      14
77    Abhay      14

In [48]:
df.loc[(df.random > 13) | (df.random == 10),:]

          name  random
temp
31       Abhay      14
81    Geekshub      10
28       Abhay      14
37       Abhay      10
50       Abhay      10
88      Teclov      10
79       Abhay      14
47       Abhay      10
77       Abhay      14

In [49]:
# Merging & concat
d1 = pd.DataFrame([['a', 1], ['b', 2]],columns=['col1', 'number'])
d2 = pd.DataFrame([['c', 3, 'lion'], ['d', 4, 'tiger']],columns=['letter', 'number', 'animal'])

In [50]:
d1

  col1  number
0    a       1
1    b       2

In [51]:
d2

  letter  number animal
0      c       3   lion
1      d       4  tiger

In [52]:
pd.concat([d1,d2],axis =0)

C:\Users\arthu\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

  animal col1 letter  number
0    NaN    a    NaN       1
1    NaN    b    NaN       2
0   lion  NaN      c       3
1  tiger  NaN      d       4

In [53]:
pd.concat([d1,d2], axis =0, ignore_index=True)

C:\Users\arthu\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

  animal col1 letter  number
0    NaN    a    NaN       1
1    NaN    b    NaN       2
2   lion  NaN      c       3
3  tiger  NaN      d       4

In [54]:
pd.concat([d1,d2], axis = 1)

  col1  number letter  number animal
0    a       1      c       3   lion
1    b       2      d       4  tiger

In [55]:
d1 = pd.DataFrame({
    "city" : ["lucknow","kanpur","agra","delhi"],
    "temperature" : [32,45,30,40]
})

In [56]:
d1

      city  temperature
0  lucknow           32
1   kanpur           45
2     agra           30
3    delhi           40

In [57]:
d2 = pd.DataFrame({
    "city" : ["delhi","lucknow","kanpur"],
    "humidity" : [68,65,75]
})

In [58]:
d2

      city  humidity
0    delhi        68
1  lucknow        65
2   kanpur        75

In [59]:
df = pd.merge(d1,d2, on='city')

In [60]:
df

      city  temperature  humidity
0  lucknow           32        65
1   kanpur           45        75
2    delhi           40        68

In [61]:
pd.merge(d1,d2, on=['city'], how ='outer')

      city  temperature  humidity
0  lucknow           32      65.0
1   kanpur           45      75.0
2     agra           30       NaN
3    delhi           40      68.0

In [62]:
pd.merge(d1, d2, on =['city'], how='left')

      city  temperature  humidity
0  lucknow           32      65.0
1   kanpur           45      75.0
2     agra           30       NaN
3    delhi           40      68.0

In [63]:
# dataset from https://github.com/codebasics/py/blob/master/pandas/6_handling_missing_data_replace/weather_data.csv

In [71]:
df1 = pd.read_csv("weather_data.csv")

In [72]:
df1

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [73]:
# pip3 install openpyxl
df1.to_excel('df_xl.xlsx', sheet_name = 'weather_data')

In [74]:
# pip3 install xlrd
df2 = pd.read_excel('df_xl.xlsx')

In [75]:
df2

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [76]:
df2.to_csv('file.csv')

In [77]:
df2.to_csv('file_noindex.csv', index = False)

In [78]:
df_group = df2.groupby("event")

In [79]:
df_group

In [80]:
for temperature in df_group:
    print(temperature)

('Rain',         day  temperature  windspeed event
0  1/1/2017           32          6  Rain
4  1/5/2017           32          4  Rain)
('Snow',         day  temperature  windspeed event
2  1/3/2017           28          2  Snow
3  1/4/2017           24          7  Snow)
('Sunny',         day  temperature  windspeed  event
1  1/2/2017           35          7  Sunny
5  1/6/2017           31          2  Sunny)

In [81]:
df_group.get_group('Rain')

        day  temperature  windspeed event
0  1/1/2017           32          6  Rain
4  1/5/2017           32          4  Rain

In [82]:
df_group.describe()

      temperature                                               windspeed  \
            count  mean       std   min   25%   50%   75%   max     count
event
Rain          2.0  32.0  0.000000  32.0  32.0  32.0  32.0  32.0       2.0
Snow          2.0  26.0  2.828427  24.0  25.0  26.0  27.0  28.0       2.0
Sunny         2.0  33.0  2.828427  31.0  32.0  33.0  34.0  35.0       2.0


      mean       std  min   25%  50%   75%  max
event
Rain   5.0  1.414214  4.0  4.50  5.0  5.50  6.0
Snow   4.5  3.535534  2.0  3.25  4.5  5.75  7.0
Sunny  4.5  3.535534  2.0  3.25  4.5  5.75  7.0

In [83]:
def hot_temp(x):
    return x > 30

In [84]:
df2['hot_temp'] = df2['temperature'].apply(hot_temp)

In [85]:
df2

        day  temperature  windspeed  event  hot_temp
0  1/1/2017           32          6   Rain      True
1  1/2/2017           35          7  Sunny      True
2  1/3/2017           28          2   Snow     False
3  1/4/2017           24          7   Snow     False
4  1/5/2017           32          4   Rain      True
5  1/6/2017           31          2  Sunny      True

In [86]:
df2['hot_temp'] = df2['temperature'].apply(lambda x: x > 30)

In [87]:
df2

        day  temperature  windspeed  event  hot_temp
0  1/1/2017           32          6   Rain      True
1  1/2/2017           35          7  Sunny      True
2  1/3/2017           28          2   Snow     False
3  1/4/2017           24          7   Snow     False
4  1/5/2017           32          4   Rain      True
5  1/6/2017           31          2  Sunny      True

In [88]:
#pivot table

In [89]:
df2.pivot_table(values = 'temperature', index = 'event', aggfunc = 'mean')

       temperature
event
Rain            32
Snow            26
Sunny           33

In [90]:
df2.pivot_table(columns = 'temperature')

temperature     24     28    31    32    35
hot_temp     False  False  True  True  True
windspeed        7      2     2     5     7

In [91]:
help(pd.DataFrame.pivot_table)

Help on function pivot_table in module pandas.core.frame:

pivot_table(self, values=None, index=None, columns=None, aggfunc='mean', fill_value=None, margins=False, dropna=True, margins_name='All')
    Create a spreadsheet-style pivot table as a DataFrame. The levels in
    the pivot table will be stored in MultiIndex objects (hierarchical
    indexes) on the index and columns of the result DataFrame

    Parameters
    ----------
    values : column to aggregate, optional
    index : column, Grouper, array, or list of the previous
        If an array is passed, it must be the same length as the data. The
        list can contain any of the other types (except list).
        Keys to group by on the pivot table index.  If an array is passed,
        it is being used as the same manner as column values.
    columns : column, Grouper, array, or list of the previous
        If an array is passed, it must be the same length as the data. The
        list can contain any of the other types (except list).
        Keys to group by on the pivot table column.  If an array is passed,
        it is being used as the same manner as column values.
    aggfunc : function, list of functions, dict, default numpy.mean
        If list of functions passed, the resulting pivot table will have
        hierarchical columns whose top level are the function names
        (inferred from the function objects themselves)
        If dict is passed, the key is column to aggregate and value
        is function or list of functions
    fill_value : scalar, default None
        Value to replace missing values with
    margins : boolean, default False
        Add all row / columns (e.g. for subtotal / grand totals)
    dropna : boolean, default True
        Do not include columns whose entries are all NaN
    margins_name : string, default 'All'
        Name of the row / column that will contain the totals
        when margins is True.

    Examples
    --------
    >>> df = pd.DataFrame({"A": ["foo", "foo", "foo", "foo", "foo",
    ...                          "bar", "bar", "bar", "bar"],
    ...                    "B": ["one", "one", "one", "two", "two",
    ...                          "one", "one", "two", "two"],
    ...                    "C": ["small", "large", "large", "small",
    ...                          "small", "large", "small", "small",
    ...                          "large"],
    ...                    "D": [1, 2, 2, 3, 3, 4, 5, 6, 7]})
    >>> df
         A    B      C  D
    0  foo  one  small  1
    1  foo  one  large  2
    2  foo  one  large  2
    3  foo  two  small  3
    4  foo  two  small  3
    5  bar  one  large  4
    6  bar  one  small  5
    7  bar  two  small  6
    8  bar  two  large  7

    >>> table = pivot_table(df, values='D', index=['A', 'B'],
    ...                     columns=['C'], aggfunc=np.sum)
    >>> table
    C        large  small
    A   B
    bar one    4.0    5.0
        two    7.0    6.0
    foo one    4.0    1.0
        two    NaN    6.0

    >>> table = pivot_table(df, values='D', index=['A', 'B'],
    ...                     columns=['C'], aggfunc=np.sum)
    >>> table
    C        large  small
    A   B
    bar one    4.0    5.0
        two    7.0    6.0
    foo one    4.0    1.0
        two    NaN    6.0

    >>> table = pivot_table(df, values=['D', 'E'], index=['A', 'C'],
    ...                     aggfunc={'D': np.mean,
    ...                              'E': [min, max, np.mean]})
    >>> table
                      D   E
                   mean max median min
    A   C
    bar large  5.500000  16   14.5  13
        small  5.500000  15   14.5  14
    foo large  2.000000  10    9.5   9
        small  2.333333  12   11.0   8

    Returns
    -------
    table : DataFrame

    See also
    --------
    DataFrame.pivot : pivot without aggregation that can handle
        non-numeric data